ErichStyger/mcuoneclipse/Examples/MCUXpresso/LPC845-BRK/LPC845-BRK_StepperClock/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_12_MODE_INACTIVE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO0_4_MODE_INACTIVE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO1_0_MODE_INACTIVE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO1_1_MODE_INACTIVE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO1_2_MODE_INACTIVE 0x00u

/*! @name PIO1_0 (number 11), LED_GREEN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LEDpin1_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LEDpin1_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LEDpin1_PORT 1U                  /*!<@brief PORT device index: 1 */
#define BOARD_INITPINS_LEDpin1_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LEDpin1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO1_1 (number 14), LED_BLUE
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LEDpin2_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LEDpin2_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LEDpin2_PORT 1U                  /*!<@brief PORT device index: 1 */
#define BOARD_INITPINS_LEDpin2_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LEDpin2_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO1_2 (number 16), LED_RED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LEDpin3_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LEDpin3_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LEDpin3_PORT 1U                  /*!<@brief PORT device index: 1 */
#define BOARD_INITPINS_LEDpin3_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LEDpin3_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_4 (number 6), BTN_K3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BTNpin3_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BTNpin3_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_BTNpin3_PORT 0U                  /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_BTNpin3_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BTNpin3_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_12 (number 4), BTN_K1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BTNpin1_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BTNpin1_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_BTNpin1_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_BTNpin1_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BTNpin1_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO0_16 (number 15), MAG_HH
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MAG_HH_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_MAG_HH_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_MAG_HH_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_MAG_HH_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MAG_HH_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_17 (number 48), MAG_MM
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_MAG_MM_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_MAG_MM_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_MAG_MM_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_MAG_MM_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MAG_MM_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M0P */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
